app/controllers/school_classes_controller.rb

  def create
    subject = SchoolClass.new(class_params(:title, :room_number))
    subject.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Modern Dance"], ["room_number", 369], ["created_at", "2019-02-25 21:59:16.521590"], ["updated_at", "2019-02-25 21:59:16.521590"]]

  def show
    @subject = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 2]]

  def edit
    @subject = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 2]]

  def update
    subject = SchoolClass.find(params[:id])
    subject.update(class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-02-25 22:14:28.522325"], ["id", 1]]