app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Hey"], ["last_name", "You"], ["created_at", "2019-02-25 21:57:08.577891"], ["updated_at", "2019-02-25 21:57:08.577891"]]
---
  def create
    student = Student.new(student_params(:first_name, :last_name))
    student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Ihavea"], ["last_name", "Namenow"], ["updated_at", "2019-02-25 22:14:11.771393"], ["id", 7]]
---
  def update
    student = Student.find(params[:id])
    student.update(student_params(:first_name, :last_name))